app/Controllers/Emprestimo.php

SELECT *
FROM `emprestimo`
SELECT *
FROM `livro`
SELECT *
FROM `aluno`
SELECT *
FROM `usuario`
SELECT *
FROM `obra`
---
    public function index(){
        $emprestimo = $this->emprestimoModel->findAll();
        $livro = $this->livroModel->findAll();
        $aluno = $this->alunoModel->findAll();
        $usuario = $this->usuarioModel->findAll();
        $obra = $this->obraModel->findAll();

INSERT INTO `emprestimo` (`data_inicio`, `data_prazo`, `id_livro`, `id_aluno`, `id_usuario`) VALUES ('2024-06-15', '32', '1', '11', '2')
UPDATE `livro` SET `disponivel` = 0
WHERE `livro`.`id` IN ('1')
---
    public function cadastrar(){
        $emprestimo = $this->request->getPost();
        $this->emprestimoModel->save($emprestimo);
        $this->livroModel->update($emprestimo['id_livro'], ['disponivel' => 0]);

SELECT *
FROM `emprestimo`
WHERE `emprestimo`.`id` = '12'
UPDATE `livro` SET `disponivel` = 1
WHERE `livro`.`id` IN ('1')
SELECT *
FROM `livro`
SELECT *
FROM `aluno`
SELECT *
FROM `obra`
SELECT *
FROM `usuario`
---
    public function editar($id){
        $emprestimo = $this->emprestimoModel->find($id);
        $this->livroModel->update($emprestimo['id_livro'], ['disponivel' => 1]);
        $livro = $this->livroModel->findAll();
        $aluno = $this->alunoModel->findAll();
        $obra = $this->obraModel->findAll();
        $usuario = $this->usuarioModel->findAll();

DELETE FROM `emprestimo`
WHERE `id` IN ('12')
---
    public function excluir(){
        $emprestimo = $this->request->getPost();
        $this->emprestimoModel->delete($emprestimo);